inventory/app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "category", "quantity", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "updated_at" = ? WHERE "items"."id" = ?  [["updated_at", "2022-01-13 01:16:11.984951"], ["id", 1]]